{
  "file_title": "قانون اساسی جمهوری اسلامی ایران",
  "article_range": "مقدمه و اصول 1-177",
  "divisions": [
    {
      "type": "مقدمه",
      "title": "مقدمه قانون اساسی",
      "article_range": "مقدمه",
      "articles": [
        { "article_number": "مقدمه", "text": "قانون اساسی جمهوری اسلامی ایران مبیّن نهادهای فرهنگی، اجتماعی، سیاسی و اقتصادی جامعه ایران بر اساس اصول و ضوابط اسلامی است که انعکاس خواست قلبی امت اسلامی می‏‌باشد. ماهیت انقلاب عظیم اسلامی ایران و روند مبارزه مردم مسلمان از ابتدا تا پیروزی که در شعارهای قاطع و کوبنده همه قشرهای مردم تبلور می‏‌یافت این خواست اساسی را مشخص کرده و اکنون در طلیعه این پیروزی بزرگ، ملت ما با تمام وجود نیل به آن را می‏‌طلبد. ویژگی بنیادی این انقلاب نسبت به دیگر نهضت‏های ایران در سده اخیر، مکتبی و اسلامی بودن آن است. ملت مسلمان ایران پس از گذر از نهضت ضد استبدادی مشروطه و نهضت ضد استعماری ملی‏ شدن نفت به این تجربه گرانبار دست یافت که علت اساسی و مشخص عدم موفقیت این نهضت‏ها مکتبی نبودن مبارزات بوده است. گرچه در نهضت‏های اخیر خط فکری اسلامی و رهبری روحانیت مبارز سهم اصلی و اساسی را بر عهده داشت، ولی به دلیل دور شدن این مبارزات از مواضع اصیل اسلامی، جنبش‏ها به سرعت به رکود کشانده شد. از اینجا وجدان بیدار ملت به رهبری مرجع عالی‏قدر تقلید حضرت آیت‏‌الله العظمی امام خمینی ضرورت پیگیری خط نهضت اصیل مکتبی و اسلامی را دریافت و این بار روحانیت مبارز کشور که همواره در صف مقدم نهضت‏های مردمی بوده و نویسندگان و روشنفکران متعهد با رهبری ایشان تحرک نوینی یافت. (آغاز نهضت اخیر ملت ایران در سال هزار و سیصد و هشتاد و دو هجری قمری برابر با هزار و سیصد و چهل و یک هجری شمسی می‏‌باشد)." },
        { "article_number": "‎طلیعه نهضت", "text": "اعتراض درهم کوبنده امام خمینی به توطئه آمریکایی «انقلاب سفید» که گامی در جهت تثبیت پایه‌‏های حکومت استبداد و تحکیم وابستگی‏‌های سیاسی، فرهنگی و اقتصادی ایران به امپریالیزم جهانی بود عامل حرکت یکپارچه ملت گشت و متعاقب آن انقلاب عظیم و خونبار امت اسلامی در خردادماه ۴۲ که در حقیقت نقطه آغاز شکوفایی این قیام شکوهمند و گسترده بود مرکزیت امام را به عنوان رهبری اسلامی تثبیت و مستحکم نمود و علی‏رغم تبعید ایشان از ایران در پی اعتراض به قانون ننگین کاپیتولاسیون (مصونیت مستشاران آمریکایی) پیوند مستحکم امت با امام همچنان استمرار یافت و ملت مسلمان و به ویژه روشنفکران متعهد و روحانیت مبارز راه خود را در میان تبعید و زندان، شکنجه و اعدام ادامه دادند. در این میان قشر آگاه و مسئول جامعه در سنگر مسجد، حوزه‏‌ای علمیه و دانشگاه به روشنگری و با الهام از مکتب انقلابی و پُربار اسلام تلاش پی‏گیر و ثمربخشی را در بالا بردن سطح آگاهی و هوشیاری مبارزاتی و مکتبی ملت مسلمان آغاز کرد. رژیم استبداد که سرکوبی نهضت اسلامی را با حمله دژخیمانه به فیضیه و دانشگاه و همه کانون‏های پرخروش انقلاب آغاز نموده بود به مذبوحانه‏‌ترین اقدامات ددمنشانه جهت رهایی از خشم انقلابی مردم، دست زد و در این میان جوخه‏‌های اعدام، شکنجه‏‌های قرون وسطایی و زندان‏های درازمدت، بهایی بود که ملت مسلمان ما به نشانه عزم راسخ خود به ادامه مبارزه می‏پرداخت. خون صدها زن و مرد جوان و با ایمان که سحرگاهان در میدان‏های تیر فریاد «الله اکبر» سر می‏دادند یا در میان کوچه و بازار هدف گلوله‏‌های دشمن قرار می‏گرفتند انقلاب اسلامی را تداوم بخشید. بیانیه‏‌ها و پیام‏های پی‏‌در‏پی امام به مناسبت‏های مختلف، آگاهی و عزم امت اسلامی را عمق و گسترش هر چه فزون‏تر داد." },
        { "article_number": "حکومت اسلامی", "text": "طرح حکومت اسلامی بر پایه ولایت فقیه که در اوج خفقان و اختناق رژیم استبدادی از سوی امام خمینی ارائه شد انگیزه مشخص و منسجم نوینی را در مردم مسلمان ایجاد نمود و راه اصیل مبارزه مکتبی اسلام را گشود که تلاش مبارزان مسلمان و متعهد را در داخل و خارج کشور فشرده‏‌تر ساخت.در چنین خطی نهضت ادامه یافت تا سرانجام نارضایی‏ها و شدت خشم مردم بر اثر فشار و اختناق روزافزون در داخل و افشاگری و انعکاس مبارزه به وسیله روحانیت و دانشجویان مبارز در سطح جهانی، بنیان‏های حاکمیت رژیم را به شدت متزلزل کرد و به ناچار رژیم و اربابانش مجبور به کاستن از فشار و اختناق و به اصطلاح باز کردن فضای سیاسی کشور شدند تا به گمان خویش دریچه اطمینانی به منظور پیشگیری از سقوط حتمی خود بگشایند. اما ملت برآشفته و آگاه و مصمم به رهبری قاطع و خلل‏‌ناپذیر امام، قیام پیروزمند و یکپارچه خود را به طرز گسترده و سراسری آغاز نمود." },
        { "article_number": "خشم ملت", "text": "انتشار نامه توهین‌‏آمیز به ساحت مقدس روحانیت و به ویژه امام خمینی در ۱۷ دی ۵۶ از طرف رژیم حاکم، این حرکت را سریع‏تر نمود و باعث انفجار خشم مردم در سراسر کشور شد و رژیم برای مهار کردن آتشفشان خشم مردم کوشید این قیام معترضانه را با به خاک و خون کشیدن خاموش کند؛ اما این خود خون بیشتری در رگ‏های انقلاب جاری ساخت و طپش‏های پی‌‏درپی انقلاب در هفتم‏‌ها و چهلم‌‏های یادبود شهدای انقلاب، حیات و گرمی و جوشش یکپارچه‏ و هر چه فزون‏تری به این نهضت در سراسر کشور بخشید و در ادامه و استمرار حرکت مردم تمامی سازمان‏های کشور با اعتصاب یکپارچه خود و شرکت در تظاهرات خیابانی در سقوط رژیم استبدادی مشارکت فعالانه جستند. همبستگی گسترده مردان و زنان از همه اقشار و جناح‏های مذهبی و سیاسی در این مبارزه به طرز چشمگیری تعیین‏‌کننده بود و مخصوصاً زنان به شکل بارزی در تمامی صحنه‌‏های این جهاد بزرگ، حضور فعال و گسترده‏ای داشتند. صحنه‏‌هایی از آن نوع که مادری را با کودکی در آغوش، شتابان به سوی میدان نبرد و لوله‏‌های مسلسل نشان می‏داد بیانگر سهم عمده و تعیین‌‏کننده این قشر بزرگ جامعه در مبارزه بود." },
        { "article_number": "بهایی که ملت پرداخت", "text": "نهال انقلاب پس از یک سال و ‏اندی مبارزه مستمر و پیگیر با باروری از خون بیش از شصت هزار شهید و صد هزار زخمی و معلول و با بر جای نهادن میلیاردها تومان خسارت مالی در میان فریادهای «استقلال، آزادی، حکومت اسلامی» به ثمر نشست و این نهضت عظیم که با تکیه بر ایمان و وحدت و قاطعیت رهبری در مراحل حساس و هیجان‏‌آمیز نهضت و نیز فداکاری ملت به پیروزی رسید موفق به درهم کوبیدن تمام محاسبات و مناسبات و نهادهای امپریالیستی گردید که در نوع خود سرفصل جدیدی بر انقلابات گسترده مردمی در جهان شد. ۲۱ و ۲۲ بهمن سال یکهزار و سیصد و پنجاه و هفت روزهای فرو ریختن بنیاد شاهنشاهی شد و استبداد داخلی و سلطه خارجی متکی بر آن را در هم شکست و با این پیروزی بزرگ، طلیعه حکومت اسلامی که خواست دیرینه مردم مسلمان است نوید پیروزی نهایی را داد. ملت ایران به طور یکپارچه و با شرکت مراجع تقلید و علمای اسلام و مقام رهبری در همه‏‌پرسی جمهوری اسلامی، تصمیم نهایی و قاطع خود را بر ایجاد نظام نوین جمهوری اسلامی اعلام کرد و با اکثریت ۹۸/۲‏% به نظام جمهوری اسلامی رأی مثبت داد. اکنون قانون اساسی جمهوری اسلامی ایران به عنوان بیانگر نهادها و مناسبات سیاسی، اجتماعی، فرهنگی و اقتصادی جامعه باید راهگشای تحکیم پایه‌‏های حکومت اسلامی و ارائه‏‌دهنده طرح نوین نظام حکومتی بر ویرانه‏‌های نظام طاغوتی قبلی گردد." },
        { "article_number": "شیوه حکومت در اسلام", "text": "حکومت از دیدگاه اسلام، برخاسته از موضع طبقاتی و سلطه‏‌گری فردی یا گروهی نیست، بلکه تبلور آرمان سیاسی ملتی هم‌‏کیش و هم‏فکر است که به خود سازمان می‏دهد تا در روند تحول فکری و عقیدتی راه خود را به سوی هدف نهایی (حرکت به سوی الله) بگشاید. ملت ما در جریان تکامل انقلابی خود از غبارها و زنگارهای طاغوتی زدوده شد و از آمیزه‌‏های فکری بیگانه خود را پاک نمود و به مواضع فکری و جهان بینی اصیل اسلامی بازگشت. اکنون بر آن است که با موازین اسلامی جامعه نمونه (اسوه) خود را بنا کند. بر چنین پایه‌‏ای، رسالت قانون اساسی این است که زمینه‏‌های اعتقادی نهضت را عینیت بخشد و شرایطی را به وجود آورد که در آن انسان با ارزش‏های والا و جهان‏‌شمول اسلامی پرورش یابد. قانون اساسی با توجه به محتوای اسلامی انقلاب ایران که حرکتی برای پیروزی تمامی مستضعفین بر مستکبرین بود زمینه تداوم این انقلاب را در داخل و خارج کشور فراهم می‏کند؛ به ویژه در گسترش روابط بین‏‌المللی با دیگر جنبش‏های اسلامی و مردمی می‏کوشد تا راه تشکیل امت واحد جهانی را هموار کند. (إن هذه أمتکم أمه واحده و أنا ربکم فاعبدون) و استمرار مبارزه در نجات ملل محروم و تحت ستم در تمامی جهان قوام یابد. با توجه به ماهیت این نهضت بزرگ، قانون اساسی تضمین‌‏گر نفی هر گونه استبداد فکری و اجتماعی و انحصار اقتصادی می‏باشد و در خط گسستن از سیستم استبدادی و سپردن سرنوشت مردم به دست خودشان تلاش می‏کند. (و یضع عنهم إصرهم و الأغلال التی کانت علیهم) در ایجاد نهادها و بنیادهای سیاسی که خود پایه تشکیل جامعه است بر اساس تلقی مکتبی، صالحان عهده‏‌دار حکومت و اداره مملکت می‏‌گردند. (ان الأرض یرثها عبادی الصالحون) و قانون‏گذاری که مبیّن ضابطه‏‌های مدیریت اجتماعی است بر مدار قرآن و سنت، جریان می‏یابد. بنابراین نظارت دقیق و جدی از ناحیه اسلام‏‌شناسان عادل و پرهیزگار و متعهد (فقهای عادل) امری محتوم و ضروری است و چون هدف از حکومت، رشد دادن انسان در حرکت به سوی نظام الهی است (و إلی الله المصیر) تا زمینه بروز و شکوفایی استعدادها به منظور تجلی ابعاد خداگونگی انسان فراهم آید (تخلّقوا بأخلاق الله) و این جز در گرو مشارکت فعال و گسترده تمامی عناصر اجتماع در روند تحول جامعه نمی‏‏تواند باشد. با توجه به این جهت، قانون اساسی زمینه چنین مشارکتی را در تمام مراحل تصمیم‏‌گیری‏های سیاسی و سرنوشت‏‌ساز برای همه افراد اجتماع فراهم می‏سازد تا در مسیر تکامل انسان، هر فردی خود دست‌‏اندرکار و مسئول رشد و ارتقاء و رهبری گردد که این همان تحقق حکومت مستضعفین در زمین خواهد بود. (و نرید أن نمنّ علی الذین استضعفوا فی الأرض و نجعلهم أئمه و نجعلهم الوارثین)‎‎" },
        { "article_number": "ولایت فقیه عادل", "text": "بر اساس ولایت امر و امامت مستمر، قانون اساسی زمینه تحقق رهبری فقیه جامع ‏الشرایطی را که از طرف مردم به عنوان رهبر شناخته می‏شود (مجاری الأمور بید العلماء بالله الأمناء علی حلاله و حرامه) آماده می‏کند تا ضامن عدم انحراف سازمان‏های مختلف از وظایف اصیل اسلامی خود باشند.‎‎‎" },
        { "article_number": "اقتصاد وسیله است نه هدف", "text": "در تحکیم بنیادهای اقتصادی، اصل، رفع نیازهای انسان در جریان رشد و تکامل اوست، نه همچون دیگر نظام‏های اقتصادی تمرکز و تکاثر ثروت و سودجویی؛ زیرا که در مکاتب مادی، اقتصاد خود هدف است و بدین جهت در مراحل رشد، اقتصاد عامل تخریب و فساد و تباهی می‏شود، ولی در اسلام اقتصاد وسیله است و از وسیله انتظاری جز کارایی بهتر در راه وصول به هدف نمی‏توان داشت. با این دیدگاه برنامه اقتصادی اسلامی فراهم کردن زمینه مناسب برای بروز خلاقیت‏های متفاوت انسانی است و بدین جهت تأمین امکانات مساوی و متناسب و ایجاد کار برای همه افراد و رفع نیازهای ضروری جهت استمرار حرکت تکاملی او بر عهده حکومت اسلامی است.‎‎‎‎‎" },
        { "article_number": "زن در قانون اساسی", "text": "در ایجاد بنیادهای اجتماعی اسلامی، نیروهای انسانی که تاکنون در خدمت استثمار همه‏جانبه خارجی بودند هویت اصلی و حقوق انسانی خود را باز می‏یابند و در این بازیابی طبیعی است که زنان به دلیل ستم بیشتری که تاکنون از نظام طاغوتی متحمل شده‏اند استیفای حقوق آنان بیشتر خواهد بود. خانواده، واحد بنیادین جامعه و کانون اصلی رشد و تعالی انسان است و توافق عقیدتی و آرمانی در تشکیل خانواده که زمینه‏ساز اصلی حرکت تکاملی و رشدیابنده انسان است اصل اساسی بوده و فراهم کردن امکانات جهت نیل به این مقصود از وظایف حکومت اسلامی است. زن در چنین برداشتی از واحد خانواده، از حالت «شیء بودن» و یا «ابزار کار بودن» در خدمت اشاعه مصرف‏زدگی و استثمار، خارج شده و ضمن بازیافتن وظیفه خطیر و پُر ارج مادری در پرورش انسان‏های مکتبی پیش‏آهنگ و خود همرزم مردان در میدا‏ن‏های فعال حیات می‏باشد و در نتیجه پذیرای مسئولیتی خطیرتر و در دیدگاه اسلامی برخوردار از ارزش و کرامتی والاتر خواهد بود.‎‎‎‎‎" },
        { "article_number": "ارتش مکتبی", "text": "در تشکیل و تجهیز نیروهای دفاعی کشور توجه بر آن است که ایمان و مکتب، اساس و ضابطه باشد. بدین جهت ارتش جمهوری اسلامی و سپاه پاسداران انقلاب در انطباق با هدف فوق شکل داده می‏شوند و نه تنها حفظ و حراست از مرزها بلکه با رسالت مکتبی، یعنی جهاد در راه خدا و مبارزه در راه گسترش حاکمیت قانون خدا در جهان را نیز عهده‏دار خواهند بود. (و أعدّوا لهم ما استطعتم من قوه و من رباط الخیل ترهبون به عدوالله و عدوکم و آخرین من دونهم)‎‎‎‎‎‎" },
        { "article_number": "قضاء در قانون اساسی", "text": "مسئله قضاء در رابطه با پاسداری از حقوق مردم در خط حرکت اسلامی، به منظور پیشگیری از انحرافات موضعی در درون امت اسلامی امری است حیاتی. از این رو ایجاد سیستم قضایی بر پایه عدل اسلامی و متشکل از قضات عادل و آشنا به ضوابط دقیق دینی پیش‏بینی شده است. این نظام به دلیل حساسیت بنیادی و دقت در مکتبی بودن آن لازم است به دور از هر نوع رابطه و مناسبات ناسالم باشد. (و إذا حکمتم بین الناس أن تحکموا بالعدل)‎‎‎‎‎‎" },
        { "article_number": "قوه مجریه", "text": "قوه مجریه به دلیل اهمیت ویژه‏ای که در رابطه با اجرای احکام و مقررات اسلامی به منظور رسیدن به روابط و مناسبات عادلانه حاکم بر جامعه دارد و همچنین ضرورتی که این مسئله حیاتی در زمینه‏سازی وصول به هدف نهایی حیات خواهد داشت بایستی راهگشای ایجاد جامعه اسلامی باشد. نتیجتاً محصور شدن در هر نوع نظام دست و پاگیر پیچیده که وصول به این هدف را کُند و یا خدشه‏‌دار کند از دیدگاه اسلامی نفی خواهد شد. بدین جهت نظام بوروکراسی که زائیده و حاصل حاکمیت‏های طاغوتی است به شدت طرد خواهد شد تا نظام اجرایی با کارایی بیشتر و سرعت افزون‏تر در اجرای تعهدات اداری بوجود آید.‎‎‎‎‎‎" },
        { "article_number": "وسایل ارتباط جمعی", "text": "وسایل ارتباط جمعی (رادیو- تلویزیون) بایستی در جهت روند تکاملی انقلاب اسلامی در خدمت اشاعه فرهنگ اسلامی قرار گیرد و در این زمینه از برخورد سالم اندیشه‏های متفاوت بهره جوید و از اشاعه و ترویج خصلت‏های تخریبی و ضد اسلامی جداً پرهیز کند. پیروی از اصول چنین قانونی که آزادی و کرامت ابناء بشر را سرلوحه اهداف خود دانسته و راه رشد و تکامل انسان را می‏گشاید بر عهده همگان است و لازم است که امت مسلمان با انتخاب مسئولین کاردان و مؤمن و نظارت مستمر بر کار آنان به طور فعالانه در ساختن جامعه اسلامی مشارکت جویند؛ به امید اینکه در بنای جامعه نمونه اسلامی (اسوه) که بتواند الگو و شهیدی بر همگی مردم جهان باشد موفق گردد. (و کذلک جعلنا أمه وسطاً لتکونوا شهداء علی الناس)‎‎‎‎‎‎" },
        { "article_number": "نمایندگان", "text": "مجلس خبرگان متشکل از نمایندگان مردم، کار تدوین قانون اساسی را بر اساس بررسی پیش‌‏نویس پیشنهادی دولت و کلیه پیشنهادهایی که از گروه‏های مختلف مردم رسیده بود در دوازده فصل که مشتمل بر یکصد و هفتاد و پنج اصل می‏باشد در طلیعه پانزدهمین قرن هجرت پیغمبر اکرم(ص)، بنیان‏گذار مکتب رهایی‌‏بخش اسلام با اهداف و انگیزه‏‌های مشروح فوق به پایان رساند؛ به این امید که این قرن، قرن حکومت جهانی مستضعفین و شکست تمامی مستکبرین گردد." }
      ]
    },
    {
      "type": "فصل",
      "title": "فصل اول - اصول کلی",
      "article_range": "1-14",
      "articles": [
        { "article_number": 1, "text": "حکومت ایران، جمهوری اسلامی است که ملت ایران، بر اساس اعتقاد دیرینه‌اش به حکومت حق و عدل قرآن... به آن رأی مثبت داد." },
        { "article_number": 2, "text": "جمهوری اسلامی، نظامی است بر پایه ایمان به: ۱- خدای یکتا (لا اله الا الله)..." },
        { "article_number": 3, "text": "دولت جمهوری اسلامی ایران موظف است برای نیل به اهداف مذکور در اصل دوم، همه امکانات خود را برای امور زیر به کار برد..." },
        { "article_number": 4, "text": "کلیه قوانین و مقررات مدنی، جزایی، مالی، اقتصادی، اداری، فرهنگی، نظامی، سیاسی و غیر اینها باید بر اساس موازین اسلامی باشد..." },
        { "article_number": 5, "text": "در زمان غیبت حضرت ولی عصر (عجل الله تعالی فرجه)، در جمهوری اسلامی ایران، ولایت امر و امامت امت بر عهده فقیه عادل و با تقوی..." },
        { "article_number": 6, "text": "در جمهوری اسلامی ایران، امور کشور باید به اتکاء آراء عمومی، از راه انتخابات... اداره شود." },
        { "article_number": 7, "text": "طبق دستور قرآن کریم: «و امرهم شوری بینهم» و «شاورهم فی الامر»، شوراها... از ارکان تصمیم‌گیری و اداره امور کشورند." },
        { "article_number": 8, "text": "در جمهوری اسلامی ایران، دعوت به خیر، امر به معروف و نهی از منکر، وظیفه‌ای است همگانی و متقابل..." },
        { "article_number": 9, "text": "در جمهوری اسلامی ایران، آزادی و استقلال و وحدت و تمامیت ارضی کشور از یکدیگر تفکیک‌ناپذیرند..." },
        { "article_number": 10, "text": "از آنجا که خانواده، واحد بنیادی جامعه اسلامی است، همه قوانین و مقررات و برنامه‌ریزی‌های مربوط باید در جهت آسان کردن تشکیل خانواده..." },
        { "article_number": 11, "text": "به حکم آیه کریمه «ان هذه امتکم امه واحده و انا ربکم فاعبدون»، همه مسلمانان یک امت‌اند..." },
        { "article_number": 12, "text": "دین رسمی ایران، اسلام و مذهب جعفری اثنی‌عشری است و این اصل الی‌الابد غیر قابل تغییر است..." },
        { "article_number": 13, "text": "ایرانیان زرتشتی، کلیمی و مسیحی تنها اقلیت‌های دینی شناخته می‌شوند که در حدود قانون در انجام مراسم دینی خود آزادند..." },
        { "article_number": 14, "text": "به حکم آیه شریفه «لاینهاکم الله...» دولت جمهوری اسلامی ایران و مسلمانان موظفند نسبت به افراد غیر مسلمان با اخلاق حسنه و قسط و عدل اسلامی عمل نمایند..." }
      ]
    },
    {
      "type": "فصل",
      "title": "فصل دوم - زبان، خط، تاریخ و پرچم رسمی کشور",
      "article_range": "15-18",
      "articles": [
        { "article_number": 15, "text": "زبان و خط رسمی و مشترک مردم ایران فارسی است. اسناد و مکاتبات و متون رسمی و کتب درسی باید با این زبان و خط باشد..." },
        { "article_number": 16, "text": "از آنجا که زبان قرآن و علوم و معارف اسلامی عربی است... این زبان باید پس از دوره ابتدایی تا پایان دوره متوسطه در همه کلاس‌ها و در همه رشته‌ها تدریس شود." },
        { "article_number": 17, "text": "مبداء تاریخ رسمی کشور، هجرت پیامبر اسلام (صلی‌الله علیه و آله و سلم) است... تعطیل رسمی هفتگی روز جمعه است." },
        { "article_number": 18, "text": "پرچم رسمی ایران به رنگ‌های سبز و سفید و سرخ با علامت مخصوص جمهوری اسلامی و شعار «الله اکبر» است." }
      ]
    },
    {
      "type": "فصل",
      "title": "فصل سوم - حقوق ملت",
      "article_range": "19-42",
      "articles": [
        { "article_number": 19, "text": "مردم ایران از هر قوم و قبیله که باشند از حقوق مساوی برخوردارند و رنگ، نژاد، زبان و مانند اینها سبب امتیاز نخواهد بود." },
        { "article_number": 20, "text": "همه افراد ملت اعم از زن و مرد یکسان در حمایت قانون قرار دارند و از همه حقوق انسانی، سیاسی، اقتصادی، اجتماعی و فرهنگی با رعایت موازین اسلام برخوردارند." },
        { "article_number": 21, "text": "دولت موظف است حقوق زن را در تمام جهات با رعایت موازین اسلامی تضمین نماید و امور زیر را انجام دهد..." },
        { "article_number": 22, "text": "حیثیت، جان، مال، حقوق، مسکن و شغل اشخاص از تعرض مصون است مگر در مواردی که قانون تجویز کند." },
        { "article_number": 23, "text": "تفتیش عقاید ممنوع است و هیچ‌کس را نمی‌توان به صرف داشتن عقیده‌ای مورد تعرض و مؤاخذه قرار داد." },
        { "article_number": 24, "text": "نشریات و مطبوعات در بیان مطالب آزادند مگر آن که مخل به مبانی اسلام یا حقوق عمومی باشد. تفصیل آن را قانون معین می‌کند." },
        { "article_number": 25, "text": "بازرسی و نرساندن نامه‌ها، ضبط و فاش کردن مکالمات تلفنی... و هر گونه تجسس ممنوع است مگر به حکم قانون." },
        { "article_number": 26, "text": "احزاب، جمعیت‌ها، انجمن‌های سیاسی و صنفی و انجمنهای اسلامی یا اقلیت‌های دینی شناخته‌شده آزادند..." },
        { "article_number": 27, "text": "تشکیل اجتماعات و راهپیمایی‌ها، بدون حمل سلاح، به شرط آن که مخل به مبانی اسلام نباشد آزاد است." },
        { "article_number": 28, "text": "هر کس حق دارد شغلی را که بدان مایل است و مخالف اسلام و مصالح عمومی و حقوق دیگران نیست برگزیند..." },
        { "article_number": 29, "text": "برخورداری از تأمین اجتماعی از نظر بازنشستگی، بیکاری، پیری، ازکارافتادگی... حقی است همگانی." },
        { "article_number": 30, "text": "دولت موظف است وسایل آموزش و پرورش رایگان را برای همه ملت تا پایان دوره متوسطه فراهم سازد..." },
        { "article_number": 31, "text": "داشتن مسکن متناسب با نیاز، حق هر فرد و خانواده ایرانی است. دولت موظف است... زمینه اجرای این اصل را فراهم کند." },
        { "article_number": 32, "text": "هیچ‌کس را نمی‌توان دستگیر کرد مگر به حکم و ترتیبی که قانون معین می‌کند..." },
        { "article_number": 33, "text": "هیچ‌کس را نمی‌توان از محل اقامت خود تبعید کرد یا از اقامت در محل مورد علاقه‌اش ممنوع... ساخت، مگر در مواردی که قانون مقرر می‌دارد." },
        { "article_number": 34, "text": "دادخواهی حق مسلم هر فرد است و هر کس می‌تواند به منظور دادخواهی به دادگاه‌های صالح رجوع نماید..." },
        { "article_number": 35, "text": "در همه دادگاه‌ها طرفین دعوا حق دارند برای خود وکیل انتخاب نمایند..." },
        { "article_number": 36, "text": "حکم به مجازات و اجرای آن باید تنها از طریق دادگاه صالح و به موجب قانون باشد." },
        { "article_number": 37, "text": "اصل، برائت است و هیچ‌کس از نظر قانون مجرم شناخته نمی‌شود، مگر این که جرم او در دادگاه صالح ثابت گردد." },
        { "article_number": 38, "text": "هرگونه شکنجه برای گرفتن اقرار و یا کسب اطلاع، ممنوع است..." },
        { "article_number": 39, "text": "هتک حرمت و حیثیت کسی که به حکم قانون دستگیر، بازداشت، زندانی یا تبعید شده، به هر صورت که باشد ممنوع و موجب مجازات است." },
        { "article_number": 40, "text": "هیچ‌کس نمی‌تواند اعمال حق خویش را وسیله اضرار به غیر یا تجاوز به منافع عمومی قرار دهد." },
        { "article_number": 41, "text": "تابعیت کشور ایران حق مسلم هر فرد ایرانی است و دولت نمی‌تواند از هیچ ایرانی سلب تابعیت کند..." },
        { "article_number": 42, "text": "اتباع خارجه می‌توانند در حدود قوانین به تابعیت ایران درآیند و سلب این تابعیت در صورتی ممکن است که دولت دیگری تابعیت آنها را بپذیرد یا خود آنها درخواست کنند." }
      ]
    },
    {
      "type": "فصل",
      "title": "فصل چهارم - اقتصاد و امور مالی",
      "article_range": "43-55",
      "articles": [
        { "article_number": 43, "text": "برای تأمین استقلال اقتصادی جامعه و ریشه‌کن کردن فقر و محرومیت و برآوردن نیازهای انسان در جریان رشد... اقتصاد جمهوری اسلامی ایران بر اساس ضوابط زیر استوار می‌شود..." },
        { "article_number": 44, "text": "نظام اقتصادی جمهوری اسلامی ایران بر پایه سه بخش دولتی، تعاونی و خصوصی... استوار است." },
        { "article_number": 45, "text": "انفال و ثروت‌های عمومی از قبیل زمین‌های موات یا رها شده... در اختیار حکومت اسلامی است تا بر طبق مصالح عامه نسبت به آنها عمل نماید." },
        { "article_number": 46, "text": "هر کس مالک حاصل کسب و کار مشروع خویش است و هیچ‌کس نمی‌تواند به عنوان مالکیت نسبت به کسب و کار خود، امکان کسب و کار را از دیگری سلب کند." },
        { "article_number": 47, "text": "مالکیت شخصی که از راه مشروع باشد محترم است. ضوابط آن را قانون معین می‌کند." },
        { "article_number": 48, "text": "در بهره‌برداری از منابع طبیعی و استفاده از درآمدهای ملی... باید تبعیض در کار نباشد." },
        { "article_number": 49, "text": "دولت موظف است ثروت‌های ناشی از ربا، غصب، رشوه... را گرفته و به صاحب حق رد کند..." },
        { "article_number": 50, "text": "در جمهوری اسلامی، حفاظت محیط زیست که نسل امروز و نسل‌های بعد باید در آن حیات اجتماعی رو به رشدی داشته باشند، وظیفه عمومی تلقی می‌گردد..." },
        { "article_number": 51, "text": "هیچ نوع مالیات وضع نمی‌شود مگر به موجب قانون. موارد معافیت و بخشودگی و تخفیف مالیاتی به موجب قانون مشخص می‌شود." },
        { "article_number": 52, "text": "بودجه سالانه کل کشور به ترتیبی که در قانون مقرر می‌شود از طرف دولت تهیه و برای رسیدگی و تصویب به مجلس شورای اسلامی تسلیم می‌گردد..." },
        { "article_number": 53, "text": "کلیه دریافت‌های دولت در حساب‌های خزانه‌داری کل متمرکز می‌شود و همه پرداخت‌ها در حدود اعتبارات مصوب به موجب قانون انجام می‌گیرد." },
        { "article_number": 54, "text": "دیوان محاسبات کشور مستقیماً زیر نظر مجلس شورای اسلامی می‌باشد..." },
        { "article_number": 55, "text": "دیوان محاسبات به کلیه حساب‌های وزارتخانه‌ها، مؤسسات، شرکت‌های دولتی و سایر دستگاه‌هایی که... از بودجه کل کشور استفاده می‌کنند... رسیدگی یا حسابرسی می‌نماید..." }
      ]
    },
    {
      "type": "فصل",
      "title": "فصل پنجم - حق حاکمیت ملت و قوای ناشی از آن",
      "article_range": "56-61",
      "articles": [
        { "article_number": 56, "text": "حاکمیت مطلق بر جهان و انسان از آن خداست و هم او، انسان را بر سرنوشت اجتماعی خویش حاکم ساخته است..." },
        { "article_number": 57, "text": "قوای حاکم در جمهوری اسلامی ایران عبارتند از: قوه مقننه، قوه مجریه و قوه قضاییه که زیر نظر ولایت مطلقه امر و امامت امت... اعمال می‌گردند." },
        { "article_number": 58, "text": "اعمال قوه مقننه از طریق مجلس شورای اسلامی است که از نمایندگان منتخب مردم تشکیل می‌شود..." },
        { "article_number": 59, "text": "در مسایل بسیار مهم اقتصادی، سیاسی، اجتماعی و فرهنگی ممکن است اعمال قوه مقننه از راه همه‌پرسی... صورت گیرد." },
        { "article_number": 60, "text": "اعمال قوه مجریه جز در اموری که در این قانون مستقیماً بر عهده رهبری گذارده شده، از طریق رئیس جمهور و وزراء است." },
        { "article_number": 61, "text": "اعمال قوه قضاییه به وسیله دادگاه‌های دادگستری است که باید طبق موازین اسلامی تشکیل شود..." }
      ]
    },
    {
      "type": "فصل",
      "title": "فصل ششم - قوه مقننه",
      "article_range": "62-99",
      "subdivisions": [
        {
          "type": "مبحث",
          "title": "مبحث اول - مجلس شورای اسلامی",
          "article_range": "62-90",
          "articles": [
            { "article_number": 62, "text": "مجلس شورای اسلامی از نمایندگان ملت که به طور مستقیم و با رأی مخفی انتخاب می‌شوند تشکیل می‌گردد..." },
            { "article_number": 63, "text": "دوره نمایندگی مجلس شورای اسلامی چهار سال است..." },
            { "article_number": 64, "text": "عده نمایندگان مجلس شورای اسلامی دویست و هفتاد نفر است..." },
            { "article_number": 65, "text": "پس از برگزاری انتخابات، جلسات مجلس شورای اسلامی با حضور دو سوم مجموع نمایندگان رسمیت می‌یابد..." },
            { "article_number": 66, "text": "ترتیب انتخاب رئیس و هیأت رئیسه مجلس... به وسیله آیین‌نامه داخلی مجلس معین می‌گردد." },
            { "article_number": 67, "text": "نمایندگان باید در نخستین جلسه مجلس به ترتیب زیر سوگند یاد کنند..." },
            { "article_number": 68, "text": "در زمان جنگ و اشغال نظامی کشور... انتخابات... متوقف می‌شود..." },
            { "article_number": 69, "text": "مذاکرات مجلس شورای اسلامی باید علنی باشد... در شرایط اضطراری... جلسه غیرعلنی تشکیل می‌شود." },
            { "article_number": 70, "text": "رئیس جمهور و معاونان او و وزیران به اجتماع یا به انفراد حق شرکت در جلسات علنی مجلس را دارند..." },
            { "article_number": 71, "text": "مجلس شورای اسلامی در عموم مسایل در حدود مقرر در قانون اساسی می‌تواند قانون وضع کند." },
            { "article_number": 72, "text": "مجلس شورای اسلامی نمی‌تواند قوانینی وضع کند که با اصول و احکام مذهب رسمی کشور یا قانون اساسی مغایرت داشته باشد..." },
            { "article_number": 73, "text": "شرح و تفسیر قوانین عادی در صلاحیت مجلس شورای اسلامی است." },
            { "article_number": 74, "text": "لوایح قانونی پس از تصویب هیأت وزیران به مجلس تقدیم می‌شود و طرح‌های قانونی به پیشنهاد حداقل پانزده نفر از نمایندگان..." },
            { "article_number": 75, "text": "طرح‌های قانونی و پیشنهادها و اصلاحاتی که... به تقلیل درآمد عمومی یا افزایش هزینه عمومی می‌انجامد... در صورتی قابل طرح در مجلس است که در آن طریق جبران... معلوم شده باشد." },
            { "article_number": 76, "text": "مجلس شورای اسلامی حق تحقیق و تفحص در تمام امور کشور را دارد." },
            { "article_number": 77, "text": "عهدنامه‌ها، مقاوله‌نامه‌ها، قراردادها و موافقت‌نامه‌های بین‌المللی باید به تصویب مجلس شورای اسلامی برسد." },
            { "article_number": 78, "text": "هرگونه تغییر در خطوط مرزی ممنوع است مگر اصلاحات جزیی..." },
            { "article_number": 79, "text": "برقراری حکومت نظامی ممنوع است. در حالت جنگ و شرایط اضطراری نظیر آن، دولت حق دارد با تصویب مجلس شورای اسلامی موقتاً محدودیت‌های ضروری را برقرار نماید..." },
            { "article_number": 80, "text": "گرفتن و دادن وام یا کمک‌های بدون عوض داخلی و خارجی از طرف دولت باید با تصویب مجلس شورای اسلامی باشد." },
            { "article_number": 81, "text": "دادن امتیاز تشکیل شرکت‌ها و مؤسسات در امور تجارتی... به خارجیان مطلقاً ممنوع است." },
            { "article_number": 82, "text": "استخدام کارشناسان خارجی از طرف دولت ممنوع است مگر در موارد ضرورت با تصویب مجلس..." },
            { "article_number": 83, "text": "بناها و اموال دولتی که از نفایس ملی باشد قابل انتقال به غیر نیست مگر با تصویب مجلس..." },
            { "article_number": 84, "text": "هر نماینده در برابر تمام ملت مسئول است و حق دارد در همه مسایل داخلی و خارجی کشور اظهار نظر نماید." },
            { "article_number": 85, "text": "سمت نمایندگی قائم به شخص است و قابل واگذاری به دیگری نیست..." },
            { "article_number": 86, "text": "نمایندگان مجلس در مقام ایفای وظایف نمایندگی در اظهار نظر و رأی خود کاملاً آزادند..." },
            { "article_number": 87, "text": "رئیس جمهور برای هیأت وزیران، پس از تشکیل... باید از مجلس رأی اعتماد بگیرد." },
            { "article_number": 88, "text": "در هر مورد که حداقل یک چهارم کل نمایندگان مجلس... از رئیس جمهور و یا هر یک از وزیران... سؤال کنند، رئیس جمهور یا وزیر موظف است در مجلس حاضر شود..." },
            { "article_number": 89, "text": "نمایندگان مجلس شورای اسلامی می‌توانند... هیأت وزیران یا هر یک از وزراء را استیضاح کنند..." },
            { "article_number": 90, "text": "هر کس شکایتی از طرز کار مجلس یا قوه مجریه یا قوه قضاییه داشته باشد، می‌تواند شکایت خود را کتباً به مجلس شورای اسلامی عرضه کند..." }
          ]
        },
        {
          "type": "مبحث",
          "title": "مبحث دوم - اختیارات و صلاحیت مجلس شورای اسلامی",
          "article_range": "91-99",
          "articles": [
            { "article_number": 91, "text": "به منظور پاسداری از احکام اسلام و قانون اساسی... شورایی به نام شورای نگهبان با ترکیب زیر تشکیل می‌شود..." },
            { "article_number": 92, "text": "اعضای شورای نگهبان برای مدت شش سال انتخاب می‌شوند..." },
            { "article_number": 93, "text": "مجلس شورای اسلامی بدون وجود شورای نگهبان اعتبار قانونی ندارد مگر..." },
            { "article_number": 94, "text": "کلیه مصوبات مجلس شورای اسلامی باید به شورای نگهبان فرستاده شود..." },
            { "article_number": 95, "text": "در مواردی که شورای نگهبان مدت ده روز را برای رسیدگی و اظهار نظر نهایی کافی نداند، می‌تواند از مجلس... خواستار تمدید وقت شود." },
            { "article_number": 96, "text": "تشخیص عدم مغایرت مصوبات مجلس... با احکام اسلام با اکثریت فقهای شورای نگهبان و تشخیص عدم تعارض آنها با قانون اساسی بر عهده اکثریت همه اعضای شورای نگهبان است." },
            { "article_number": 97, "text": "اعضای شورای نگهبان به منظور تسریع در کار می‌توانند هنگام مذاکره درباره لایحه یا طرح قانونی در مجلس حاضر شده..." },
            { "article_number": 98, "text": "تفسیر قانون اساسی به عهده شورای نگهبان است که با تصویب سه چهارم آنان انجام می‌شود." },
            { "article_number": 99, "text": "شورای نگهبان نظارت بر انتخابات مجلس خبرگان رهبری، ریاست جمهوری، مجلس شورای اسلامی و مراجعه به آراء عمومی و همه‌پرسی را بر عهده دارد." }
          ]
        }
      ]
    },
    {
      "type": "فصل",
      "title": "فصل هفتم - شوراها",
      "article_range": "100-106",
      "articles": [
        { "article_number": 100, "text": "برای پیشبرد سریع برنامه‌های اجتماعی، اقتصادی، عمرانی... اداره امور هر روستا، بخش، شهر... با نظارت شورایی به نام شورای... صورت می‌گیرد." },
        { "article_number": 101, "text": "به منظور جلوگیری از تبعیض... شورای عالی استان‌ها مرکب از نمایندگان شوراهای استان‌ها تشکیل می‌شود." },
        { "article_number": 102, "text": "شورای عالی استان‌ها حق دارد در حدود وظایف خود، طرح‌هایی را مستقیماً یا از طریق دولت به مجلس شورای اسلامی پیشنهاد کند." },
        { "article_number": 103, "text": "استانداران، فرمانداران، بخشداران و سایر مقامات کشوری... ملزم به رعایت تصمیمات آنها هستند." },
        { "article_number": 104, "text": "به منظور تأمین قسط اسلامی و همکاری... در واحدهای تولیدی، صنعتی و کشاورزی، شوراهایی مرکب از نمایندگان کارگران و دهقانان... تشکیل می‌شود." },
        { "article_number": 105, "text": "تصمیمات شوراها نباید مخالف موازین اسلام و قوانین کشور باشد." },
        { "article_number": 106, "text": "انحلال شوراها جز در صورت انحراف از وظایف قانونی ممکن نیست..." }
      ]
    },
    {
      "type": "فصل",
      "title": "فصل هشتم - رهبر یا شورای رهبری",
      "article_range": "107-112",
      "articles": [
        { "article_number": 107, "text": "پس از مرجع عالیقدر تقلید... حضرت آیت‌الله العظمی امام خمینی... تعیین رهبر به عهده خبرگان منتخب مردم است..." },
        { "article_number": 108, "text": "قانون مربوط به تعداد و شرایط خبرگان، کیفیت انتخاب آنها و آیین‌نامه داخلی جلسات آنان... در صلاحیت خود آنان است." },
        { "article_number": 109, "text": "شرایط و صفات رهبر: ۱- صلاحیت علمی لازم... ۲- عدالت و تقوای لازم... ۳- بینش صحیح سیاسی و اجتماعی..." },
        { "article_number": 110, "text": "وظایف و اختیارات رهبر: ۱- تعیین سیاست‌های کلی نظام... ۲- نظارت بر حسن اجرای سیاست‌های کلی نظام..." },
        { "article_number": 111, "text": "هرگاه رهبر از انجام وظایف قانونی خود ناتوان شود... از مقام خود برکنار خواهد شد. تشخیص این امر به عهده خبرگان... می‌باشد." },
        { "article_number": 112, "text": "مجمع تشخیص مصلحت نظام برای تشخیص مصلحت... به دستور رهبری تشکیل می‌شود." }
      ]
    },
    {
      "type": "فصل",
      "title": "فصل نهم - قوه مجریه",
      "article_range": "113-151",
      "subdivisions": [
        {
          "type": "مبحث",
          "title": "مبحث اول - ریاست جمهوری و وزراء",
          "article_range": "113-142",
          "articles": [
            { "article_number": 113, "text": "پس از مقام رهبری، رئیس جمهور عالی‌ترین مقام رسمی کشور است..." },
            { "article_number": 114, "text": "رئیس جمهور برای مدت چهار سال با رأی مستقیم مردم انتخاب می‌شود..." },
            { "article_number": 115, "text": "رئیس جمهور باید از میان رجال مذهبی و سیاسی... انتخاب گردد: ایرانی‌الاصل، تابع ایران..." },
            { "article_number": 116, "text": "نامزدهای ریاست جمهوری باید قبل از شروع انتخابات آمادگی خود را رسماً اعلام کنند." },
            { "article_number": 117, "text": "رئیس جمهور با اکثریت مطلق آراء شرکت‌کنندگان انتخاب می‌شود..." },
            { "article_number": 118, "text": "مسئولیت نظارت بر انتخابات ریاست جمهوری... بر عهده شورای نگهبان است..." },
            { "article_number": 119, "text": "انتخاب رئیس جمهور جدید باید حداقل یک ماه پیش از پایان دوره ریاست جمهوری قبلی انجام شده باشد..." },
            { "article_number": 120, "text": "هرگاه در فاصله ده روز پیش از رأی‌گیری یکی از نامزدهایی که صلاحیت او... احراز شده فوت کند، انتخابات به مدت دو هفته به تأخیر می‌افتد." },
            { "article_number": 121, "text": "رئیس جمهور در مجلس شورای اسلامی... به ترتیب زیر سوگند یاد می‌کند..." },
            { "article_number": 122, "text": "رئیس جمهور در حدود اختیارات و وظایفی که به موجب قانون اساسی... به عهده دارد در برابر ملت و رهبر و مجلس... مسئول است." },
            { "article_number": 123, "text": "رئیس جمهور موظف است مصوبات مجلس یا نتیجه همه‌پرسی را... امضاء کند..." },
            { "article_number": 124, "text": "رئیس جمهور می‌تواند برای انجام وظایف قانونی خود معاونانی داشته باشد. معاون اول رئیس جمهور..." },
            { "article_number": 125, "text": "امضای عهدنامه‌ها، مقاوله‌نامه‌ها... پس از تصویب مجلس شورای اسلامی با رئیس جمهور یا نماینده قانونی او است." },
            { "article_number": 126, "text": "رئیس جمهور مسئولیت امور برنامه و بودجه و امور اداری و استخدامی کشور را مستقیماً بر عهده دارد..." },
            { "article_number": 127, "text": "رئیس جمهور می‌تواند در موارد خاص... نماینده یا نمایندگان ویژه با اختیارات مشخص تعیین نماید." },
            { "article_number": 128, "text": "سفیران به پیشنهاد وزیر امور خارجه و تصویب رئیس جمهور تعیین می‌شوند." },
            { "article_number": 129, "text": "اعطای نشان‌های دولتی با رئیس جمهور است." },
            { "article_number": 130, "text": "رئیس جمهور استعفای خود را به رهبر تقدیم می‌کند..." },
            { "article_number": 131, "text": "در صورت فوت، عزل، استعفاء، غیبت یا بیماری بیش از دو ماه رئیس جمهور... معاون اول رئیس جمهور با موافقت رهبری، اختیارات و مسئولیت‌های وی را بر عهده می‌گیرد..." },
            { "article_number": 132, "text": "در مدتی که اختیارات و مسئولیت‌های رئیس جمهور بر عهده معاون اول... است، وزراء را نمی‌توان استیضاح کرد..." },
            { "article_number": 133, "text": "وزراء به پیشنهاد رئیس جمهور و با رأی اعتماد مجلس، منصوب می‌شوند..." },
            { "article_number": 134, "text": "ریاست هیأت وزیران با رئیس جمهور است که بر کار وزیران نظارت دارد..." },
            { "article_number": 135, "text": "وزراء تا زمانی که عزل نشده‌اند... در سمت خود باقی می‌مانند. استعفای هیأت وزیران یا هر یک از آنان به رئیس جمهور تسلیم می‌شود." },
            { "article_number": 136, "text": "رئیس جمهور می‌تواند وزراء را عزل کند و در این صورت باید برای وزیر... جدید از مجلس رأی اعتماد بگیرد..." },
            { "article_number": 137, "text": "هر یک از وزیران مسئول وظایف خاص خویش در برابر رئیس جمهور و مجلس است..." },
            { "article_number": 138, "text": "علاوه بر مواردی که هیأت وزیران... مأمور تدوین آیین‌نامه‌های اجرایی قوانین می‌شود، هیأت وزیران حق دارد برای انجام وظایف اداری... به وضع تصویب‌نامه و آیین‌نامه بپردازد." },
            { "article_number": 139, "text": "صلح دعاوی راجع به اموال عمومی و دولتی یا ارجاع آن به داوری... موکول به تصویب هیأت وزیران است..." },
            { "article_number": 140, "text": "رسیدگی به اتهام رئیس جمهور و معاونان او و وزیران در مورد جرایم عادی... در دادگاه‌های عمومی دادگستری انجام می‌شود." },
            { "article_number": 141, "text": "رئیس جمهور، معاونان رئیس جمهور، وزیران و کارمندان دولت نمی‌توانند بیش از یک شغل دولتی داشته باشند..." },
            { "article_number": 142, "text": "دارایی رهبر، رئیس جمهور، معاونان رئیس جمهور، وزیران و همسر و فرزندان آنان قبل و بعد از خدمت، توسط رئیس قوه قضاییه رسیدگی می‌شود..." }
          ]
        },
        {
          "type": "مبحث",
          "title": "مبحث دوم - ارتش و سپاه پاسداران انقلاب اسلامی",
          "article_range": "143-151",
          "articles": [
            { "article_number": 143, "text": "ارتش جمهوری اسلامی ایران پاسداری از استقلال و تمامیت ارضی و نظام جمهوری اسلامی کشور را بر عهده دارد." },
            { "article_number": 144, "text": "ارتش جمهوری اسلامی ایران باید ارتشی اسلامی باشد که ارتشی مکتبی و مردمی است..." },
            { "article_number": 145, "text": "هیچ فرد خارجی به عضویت در ارتش و نیروهای انتظامی کشور پذیرفته نمی‌شود." },
            { "article_number": 146, "text": "استقرار هرگونه پایگاه نظامی خارجی در کشور هر چند به عنوان استفاده‌های صلح‌آمیز باشد، ممنوع است." },
            { "article_number": 147, "text": "دولت باید در زمان صلح از افراد و تجهیزات فنی ارتش در کارهای امدادی، آموزشی، تولیدی، و جهاد سازندگی... استفاده کند." },
            { "article_number": 148, "text": "هر نوع بهره‌برداری شخصی از وسایل و امکانات ارتش... ممنوع است." },
            { "article_number": 149, "text": "ترفیع درجه نظامیان و سلب آن به موجب قانون است." },
            { "article_number": 150, "text": "سپاه پاسداران انقلاب اسلامی... برای ادامه نقش خود در نگهبانی از انقلاب و دستاوردهای آن پا بر جا می‌ماند." },
            { "article_number": 151, "text": "به حکم آیه کریمه «و اعدوا لهم مااستطعتم من قوه...» دولت موظف است برای همه افراد کشور برنامه و امکانات آموزش نظامی را... فراهم نماید." }
          ]
        }
      ]
    },
    {
      "type": "فصل",
      "title": "فصل دهم - سیاست خارجی",
      "article_range": "152-155",
      "articles": [
        { "article_number": 152, "text": "سیاست خارجی جمهوری اسلامی ایران بر اساس نفی هرگونه سلطه‌جویی و سلطه‌پذیری، حفظ استقلال همه‌جانبه... استوار است." },
        { "article_number": 153, "text": "هرگونه قرارداد که موجب سلطه بیگانه بر منابع طبیعی و اقتصادی، فرهنگ، ارتش و دیگر شؤون کشور گردد، ممنوع است." },
        { "article_number": 154, "text": "جمهوری اسلامی ایران سعادت انسان در کل جامعه بشری را آرمان خود می‌داند... بنابراین در عین خودداری کامل از هرگونه دخالت در امور داخلی ملت‌های دیگر، از مبارزه حق‌طلبانه مستضعفین در برابر مستکبرین... حمایت می‌کند." },
        { "article_number": 155, "text": "دولت جمهوری اسلامی ایران می‌تواند به کسانی که به منظور سیاسی، به ایران پناهنده شوند، پناه دهد..." }
      ]
    },
    {
      "type": "فصل",
      "title": "فصل یازدهم - قوه قضائیه",
      "article_range": "156-174",
      "articles": [
        { "article_number": 156, "text": "قوه قضاییه قوه‌ای است مستقل که پشتیبان حقوق فردی و اجتماعی و مسئول تحقق بخشیدن به عدالت و عهده‌دار وظایف زیر است..." },
        { "article_number": 157, "text": "به منظور انجام مسئولیت‌های قوه قضاییه... مقام رهبری یک نفر مجتهد عادل... را برای مدت پنج سال به عنوان رئیس قوه قضاییه تعیین می‌نماید..." },
        { "article_number": 158, "text": "وظایف رئیس قوه قضاییه به شرح زیر است: ۱- ایجاد تشکیلات لازم در دادگستری... ۲- تهیه لوایح قضایی... ۳- استخدام قضات عادل و شایسته..." },
        { "article_number": 159, "text": "مرجع رسمی تظلمات و شکایات، دادگستری است. تشکیل دادگاه‌ها و تعیین صلاحیت آنها منوط به حکم قانون است." },
        { "article_number": 160, "text": "وزیر دادگستری مسئولیت کلیه مسایل مربوط به روابط قوه قضاییه با قوه مجریه و قوه مقننه را بر عهده دارد..." },
        { "article_number": 161, "text": "دیوان عالی کشور به منظور نظارت بر اجرای صحیح قوانین در محاکم و ایجاد وحدت رویه قضایی... تشکیل می‌گردد." },
        { "article_number": 162, "text": "رئیس دیوان عالی کشور و دادستان کل باید مجتهد عادل و آگاه به امور قضایی باشند..." },
        { "article_number": 163, "text": "صفات و شرایط قاضی طبق موازین فقهی به وسیله قانون معین می‌شود." },
        { "article_number": 164, "text": "قاضی را نمی‌توان از مقامی که شاغل آن است بدون محاکمه و ثبوت جرم یا تخلف... منفصل کرد..." },
        { "article_number": 165, "text": "محاکمات، علنی انجام می‌شود... مگر آن که به تشخیص دادگاه، علنی بودن آن منافی عفت عمومی یا نظم عمومی باشد..." },
        { "article_number": 166, "text": "احکام دادگاه‌ها باید مستدل و مستند به مواد قانون و اصولی باشد که بر اساس آن حکم صادر شده است." },
        { "article_number": 167, "text": "قاضی موظف است کوشش کند دعوا را از طریق صلح و سازش خاتمه دهد... و نمی‌تواند به بهانه سکوت... قوانین مدون از رسیدگی... امتناع ورزد." },
        { "article_number": 168, "text": "رسیدگی به جرایم سیاسی و مطبوعاتی علنی است و با حضور هیأت منصفه در محاکم دادگستری صورت می‌گیرد..." },
        { "article_number": 169, "text": "هیچ فعلی یا ترک فعلی به استناد قانونی که بعد از آن وضع شده است جرم محسوب نمی‌شود." },
        { "article_number": 170, "text": "قضات دادگاه‌ها مکلفند از اجرای تصویب‌نامه‌ها و آیین‌نامه‌های دولتی که مخالف با قوانین... است خودداری کنند..." },
        { "article_number": 171, "text": "هرگاه در اثر تقصیر یا اشتباه قاضی... ضرر مادی یا معنوی متوجه کسی گردد، در صورت تقصیر، مقصر... ضامن است..." },
        { "article_number": 172, "text": "برای رسیدگی به جرایم مربوط به وظایف خاص نظامی یا انتظامی اعضاء ارتش، ژاندارمری، شهربانی و سپاه... محاکم نظامی مطابق قانون تشکیل می‌گردد..." },
        { "article_number": 173, "text": "به منظور رسیدگی به شکایات، تظلمات و اعتراضات مردم نسبت به مأمورین... دیوانی به نام «دیوان عدالت اداری» زیر نظر رئیس قوه قضاییه تأسیس می‌گردد." },
        { "article_number": 174, "text": "بر اساس حق نظارت قوه قضاییه... سازمانی به نام «سازمان بازرسی کل کشور» زیر نظر رئیس قوه قضاییه تشکیل می‌گردد." }
      ]
    },
    {
      "type": "فصل",
      "title": "فصل دوازدهم - صدا و سیما",
      "article_range": "175",
      "articles": [
        { "article_number": 175, "text": "در صدا و سیمای جمهوری اسلامی ایران، آزادی بیان و نشر افکار با رعایت موازین اسلامی و مصالح کشور باید تأمین گردد..." }
      ]
    },
    {
      "type": "فصل",
      "title": "فصل سیزدهم - شورای عالی امنیت ملی",
      "article_range": "176",
      "articles": [
        { "article_number": 176, "text": "به منظور تأمین منافع ملی و پاسداری از انقلاب اسلامی... «شورای عالی امنیت ملی» به ریاست رئیس جمهور، با وظایف زیر تشکیل می‌گردد..." }
      ]
    },
    {
      "type": "فصل",
      "title": "فصل چهاردهم - بازنگری در قانون اساسی",
      "article_range": "177",
      "articles": [
        { "article_number": 177, "text": "بازنگری در قانون اساسی جمهوری اسلامی ایران، در موارد ضروری به ترتیبی که در این اصل مقرر می‌شود، به عمل می‌آید..." }
      ]
    }
  ]
}
